'use strict';
/* 6**. (Это задание не является частью курса, можете его не делать, оно для тех кому мало
    обычных заданий, требует времени и возможно гугления, делайте по желанию.)
    Программа должна спросить у пользователя число, это будет количество денег, которое он хочет
    положить на счет в банке. Затем программа должна выдать примерно такое сообщение:
    "Ваша сумма в 101 рубль успешно зачислена." - в случае если пользователь ввел 101
    "Ваша сумма в 10020 рублей успешно зачислена." - в случае если пользователь ввел 10020
    "Ваша сумма в 120104 рубля успешно зачислена." - в случае если пользователь ввел 120104
    То есть ваша задача выводить слово «рубль» в правильном падеже, в зависимости от введенного
    числа. */

let money = prompt('Введите количество рублей, которые вы хотите положить на счет в банке: ', '');
// Предполагается, что всегда вводится неотрицательное число(без пустых строк, чисел и отмен)
if (((+(money.charAt(money.length - 2) + money.charAt(money.length - 1))) >= 10) && ((+(money.charAt(money.length - 2) + money.charAt(money.length - 1))) <= 19)) {
    alert('Ваша сумма в ' + money + ' рублей успешно зачислена.');
} else {
    switch (money.charAt(money.length - 1)) {
        case '1':
            alert('Ваша сумма в ' + money + ' рубль успешно зачислена.');
            break;
        case '2':
        case '3':
        case '4':
            alert('Ваша сумма в ' + money + ' рубля успешно зачислена.');
            break;
        default:
            alert('Ваша сумма в ' + money + ' рублей успешно зачислена.');
            break;
    }
}